In [1]:
ls

Project1.ipynb  Salary_dataset.csv

In [2]:
import pandas as pd
data = pd.read_csv('Salary_dataset.csv')
data.head()

   No  YearsExperience   Salary
0   0              1.2  39344.0
1   1              1.4  46206.0
2   2              1.6  37732.0
3   3              2.1  43526.0
4   4              2.3  39892.0

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   No               30 non-null     int64
 1   YearsExperience  30 non-null     float64
 2   Salary           30 non-null     float64
dtypes: float64(2), int64(1)
memory usage: 848.0 bytes

In [4]:
data = data.set_index('No')

In [5]:
data.head()

    YearsExperience   Salary
No
0               1.2  39344.0
1               1.4  46206.0
2               1.6  37732.0
3               2.1  43526.0
4               2.3  39892.0